heiso/macrolev/firmware/esp32-s3/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_LOG_COLORS=y
CONFIG_WL_SECTOR_SIZE_512=y
CONFIG_TINYUSB_DEBUG_LEVEL=3
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Heiso"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Macrolev Rev.2"
CONFIG_TINYUSB_DESC_CDC_STRING="Macrolev CDC Device"
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=1024
CONFIG_TINYUSB_CDC_TX_BUFSIZE=1024
CONFIG_TINYUSB_HID_COUNT=1
